:PROPERTIES:
:ID:       62380240-2804-497b-b806-8a849dbdecd0
:END:
#+title: Rust type system
#+filetags: rust

- one of their most fundamental roles of types is to hint how to interpret bits of memory
*** examples
#+begin_src rust
trait AssociatedType {
    type Assoc;
    type Aff;
}

struct Struct;

#[derive(Debug)]
struct OtherStruct;

impl AssociatedType for Struct {
    type Assoc = OtherStruct;
    type Aff = String;
}

impl OtherStruct {
    fn new() -> OtherStruct { OtherStruct }
}

fn main () {
    println!("{:?}\n{:?}",
         <Struct as AssociatedType>::Assoc::new(),
         <Struct as AssociatedType>::Aff::new());
}
#+end_src

#+RESULTS:
: OtherStruct
: ""
